# Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

- Specifically, they want the data from the following files included in your database:
>- Title Basics:<br>
>> - Movie ID (tconst)<br>
>> -Primary Title<br>
>> -Start Year<br>
>> -Runtime (in Minutes)<br>
>> -Genres

> -Title Ratings<br>
>> -Movie ID (tconst)<br>
>> -Average Movie Rating<br>
>> -Number of Votes

> -The TMDB API Results (multiple files)
>> -Movie ID<br>
>> -Revenue<br>
>> -Budget<br>
>> -Certification (MPAA Rating)

In [1]:
import json
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1968
1  tt0000002            5.8       263
2  tt0000005            6.2      2611
3  tt0000006            5.1       181
4  tt0000007            5.4       817

In [4]:
tmdb_api = pd.read_csv("Data/tmdb_results_combined.csv.gz")
tmdb_api.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.114,2191.0,PG

# Transform
## Required Transformation Steps for Title Basics:
- Normalize Genre:

>Convert the single string of genres from title basics into 2 new tables.
>1. title_genres: with the columns:<br>
> - tconst<br>
> - genre_id

> 2. genres:<br>
> - genre_id<br>
> - genre_name

- Discard unnecessary information:

> - For the title basics table, drop the following columns:<br>
> - "original_title" (we will use the primary title column instead)<br>
> - "isAdult" ("Adult" will show up in the genres so this is redundant information).<br>
> - "titleType" (every row will be a movie).<br>
> - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [5]:
# Splitting and encoding unique genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(1)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"

In [6]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
81696,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81696,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81696,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81697,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
81697,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [7]:
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [8]:
# Creating title_genres table
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [9]:
# Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
# Making new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].replace(genre_map)

In [11]:
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [12]:
# Mak'ing data frame with named cols from .keys and .values
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genres

    genre_name  genre_id
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Short        20
21       Sport        21
22   Talk-Show        22
23    Thriller        23
24         War        24
25     Western        25

In [13]:
# Discarding unecessary information
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81698 entries, 0 to 81697
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81698 non-null  object
 1   titleType       81698 non-null  object
 2   primaryTitle    81698 non-null  object
 3   originalTitle   81698 non-null  object
 4   isAdult         81698 non-null  int64
 5   startYear       81698 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81698 non-null  int64
 8   genres          81698 non-null  object
 9   genres_split    81698 non-null  object
dtypes: float64(2), int64(2), object(6)
memory usage: 6.2+ MB

In [14]:
basics = basics.drop(columns=['originalTitle', 'isAdult', 'titleType', 'genres', 'endYear', 'genres_split'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81698 entries, 0 to 81697
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81698 non-null  object
 1   primaryTitle    81698 non-null  object
 2   startYear       81698 non-null  float64
 3   runtimeMinutes  81698 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.5+ MB

In [15]:
tmdb_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2564 entries, 0 to 2563
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2564 non-null   object
 1   adult                  2562 non-null   float64
 2   backdrop_path          1394 non-null   object
 3   belongs_to_collection  205 non-null    object
 4   budget                 2562 non-null   float64
 5   genres                 2562 non-null   object
 6   homepage               173 non-null    object
 7   id                     2562 non-null   float64
 8   original_language      2562 non-null   object
 9   original_title         2562 non-null   object
 10  overview               2512 non-null   object
 11  popularity             2562 non-null   float64
 12  poster_path            2305 non-null   object
 13  production_companies   2562 non-null   object
 14  production_countries   2562 non-null   object
 15  release_date           2544 non-null   object
 16  revenue                2562 non-null   float64
 17  runtime                2562 non-null   float64
 18  spoken_languages       2562 non-null   object
 19  status                 2562 non-null   object
 20  tagline                1099 non-null   object
 21  title                  2562 non-null   object
 22  video                  2562 non-null   float64
 23  vote_average           2562 non-null   float64
 24  vote_count             2562 non-null   float64
 25  certification          815 non-null    object
dtypes: float64(9), object(17)
memory usage: 520.9+ KB

In [16]:
tmdb_api = tmdb_api[['imdb_id', 'budget', 'revenue', 'certification']]
tmdb_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2564 entries, 0 to 2563
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2564 non-null   object
 1   budget         2562 non-null   float64
 2   revenue        2562 non-null   float64
 3   certification  815 non-null    object
dtypes: float64(2), object(2)
memory usage: 80.2+ KB

# Creating MySQL Database

In [17]:
# Create connection string and engine
username = 'root'
password = 'root'
db_name = 'movies'
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [21]:
create_database(connection)

In [23]:
database_exists(connection)

True

In [18]:
# Using tconst (string type) as the primary key
from sqlalchemy.types import *

# Calculating max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

In [19]:
# Creating a schema dictonary using Sqlalchemy datatype objects
schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()}

In [24]:
# Saving basics table to SQL
basics.to_sql('title_basics',engine,dtype=schema,if_exists='replace', index=False)

81698

In [25]:
# Running query to add primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [26]:
# Showing first five rows of table
q =  """
    SELECT* from title_basics limit 5;
    """
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [27]:
# Creating schema dictionary for rating table
rschema = {
    'tconst': String(key_len+1),
    'averagerating': Float(),
    'numvotes': Integer()
}

In [28]:
# Saving ratings table to SQL
ratings.to_sql('title_ratings', engine,dtype=rschema, if_exists='replace', index=False)
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [29]:
# Showing first five rows of table
q =  """
    SELECT* from title_ratings limit 5;
    """
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1968
1  tt0000002            5.8       263
2  tt0000005            6.2      2611
3  tt0000006            5.1       181
4  tt0000007            5.4       817

In [30]:
# Saving title_genres table to SQL
title_genres.to_sql('title_genres',engine,if_exists='replace',index=False)

153068

In [32]:
# Showing first five rows of table
q =  """
    SELECT* from title_genres limit 5;
    """
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

In [40]:
# Saving title_genres table to SQL
genres.to_sql('genres',engine,if_exists='replace',index=False)

26

In [41]:
# Showing first five rows of table
q =  """
    SELECT* from genres limit 5;
    """
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [37]:
tmdb_api.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2564 entries, 0 to 2563
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2564 non-null   object
 1   budget         2562 non-null   float64
 2   revenue        2562 non-null   float64
 3   certification  815 non-null    object
dtypes: float64(2), object(2)
memory usage: 80.2+ KB

In [38]:
# Calculating max string lengths for object columns in tmbd API data
id_len = tmdb_api['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_api['certification'].fillna('').map(len).max()

In [43]:
# Creating a schema dictonary using Sqlalchemy datatype objects
tschema = {
    "imdb_id": String(id_len+1), 
    "budget": Float(),
    'revenue':Float(),
    'certificaiton':Text(cert_len)}

In [50]:
# Saving api data table to SQL
tmdb_api.to_sql('tmdb_data',engine,dtype=tschema,if_exists='replace', index=False)

2563

In [51]:
# Running query to add primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [52]:
# Showing first five rows of table
q =  """
    SELECT* from tmdb_data limit 5;
    """
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0113026  10000000.0         0.0          None
3  tt0113092         0.0         0.0          None
4  tt0114447         0.0         0.0          None